namespace Contract.Data.Models.Enums
{
    public enum WorkTypeCode
    {
        /// <summary>
        ///     топография, без НДС
        /// </summary>
        Col13 = 13,

        /// <summary>
        ///     геология, без НДС
        /// </summary>
        Col14 = 14,

        /// <summary>
        ///     геодезия (в т.ч. перенос в натуру,вынос красных линий и другие), с НДС
        /// </summary>
        Col15 = 15,

        /// <summary>
        ///     освидетельствование котлована (в т.ч. опр.плотн.грунта в обратной засыпке пазух фунд.и в подсыпке под полы), с НДС
        /// </summary>
        Col16 = 16,

        /// <summary>
        ///     проектные работы идругие, с НДС
        /// </summary>
        Col17 = 17,

        /// <summary>
        ///     техническое обследование, с НДС
        /// </summary>
        Col18 = 18,

        /// <summary>
        ///     СМР, с НДС
        /// </summary>
        Col19 = 19,

        /// <summary>
        ///     картографические работы, с НДС
        /// </summary>
        Col20 = 20,

        /// <summary>
        ///     геоинформатика в т.ч. ГИС,ГГК и ЭГИТИ, без НДС
        /// </summary>
        Col21 = 21,

        /// <summary>
        ///     выдача архивных материалов, с НДС
        /// </summary>
        Col22 = 22,

        /// <summary>
        ///     выдача копии топопланов, с НДС
        /// </summary>
        Col23 = 23,

        /// <summary>
        ///     прочие работы
        /// </summary>
        Col24 = 24
    }
}